In [51]:
import pandas as pd
import numpy as np

In [52]:
# remove row  : it is used to dropna

data={"name":["roshani","savi",np.nan,"ankush","nikita"],"age":[12,23,34,45,np.nan],"salary":[2000,np.nan,4000,5000,6000]}

In [53]:
data

{'name': ['roshani', 'savi', nan, 'ankush', 'nikita'],
 'age': [12, 23, 34, 45, nan],
 'salary': [2000, nan, 4000, 5000, 6000]}

In [54]:
d=pd.DataFrame(data)

In [55]:
d

      name   age  salary
0  roshani  12.0  2000.0
1     savi  23.0     NaN
2      NaN  34.0  4000.0
3   ankush  45.0  5000.0
4   nikita   NaN  6000.0

In [46]:
e=d.dropna()

In [47]:
e

      name   age  salary
0  roshani  12.0  2000.0
3   ankush  45.0  5000.0

In [ ]:
# Note: By default, the dropna() method returns a new DataFrame, and will not change the original.

In [ ]:
# If you want to change the original DataFrame, use the inplace = True argument

In [58]:
d.dropna(inplace=True)

In [59]:
d   # original data

      name   age  salary
0  roshani  12.0  2000.0
3   ankush  45.0  5000.0

In [60]:
d.to_string()

'      name   age  salary\n0  roshani  12.0  2000.0\n3   ankush  45.0  5000.0'